In [3]:
import pandas as pd
import numpy as np

In [7]:
titanic = pd.read_csv('data/titanic.csv')

_____________
_____________
**Exercício:** Existe diferença de sobrevivência por portão de embarque? E diferença no preço do ticket? Porque você acha que tem essa diferença?

In [8]:
# Resposta
titanic.groupby(['Survived'])[['Fare']].mean()

               Fare
Survived
0         22.117887
1         48.395408

In [9]:
titanic.groupby(['Embarked'])[['Survived']].mean()

          Survived
Embarked
C         0.553571
Q         0.389610
S         0.336957

In [10]:
titanic.groupby(['Embarked', 'Pclass'])[['Survived','Age']].agg(['mean','count'])

                 Survived              Age
                     mean count       mean count
Embarked Pclass
C        1       0.694118    85  38.027027    74
         2       0.529412    17  22.766667    15
         3       0.378788    66  20.741951    41
Q        1       0.500000     2  38.500000     2
         2       0.666667     3  43.500000     2
         3       0.375000    72  25.937500    24
S        1       0.582677   127  38.152037   108
         2       0.463415   164  30.386731   156
         3       0.189802   353  25.696552   290

_________________________
_________________________
**Exercício:** Crie uma coluna com a média de Fare e outra com a média de idade para cada classe da coluna Survived. Você consegue fazer isso de uma única vez?

In [11]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Resposta
df[['fare_medio', 'age_medio']] = df.groupby('Survived')[['Fare', 'Age']].transform('mean')

## Exercícios

1. Considere a existência de três tabelas distintas:
* customer.csv : Possui a informação dos clientes em duas colunas: customer id  customer name
* products.csv : Conté informação dos produtos vendidos pela empresa em três colunas - p_id (product id), product (name) e price
* sales.csv : Contém informações das vendas realizadas em seis colunas - sale_id, c_id (customer id), p_id (product_id), qty (quantity sold), store (name)

Conhecendo as bases e utilizando os métodos de concatenação de bases responda:

In [7]:
customer = pd.read_csv('./data/customer.csv')
products = pd.read_csv('./data/products.csv')
sales = pd.read_csv('./data/sales.csv')

a) Quais produtos não foram vendidos?

In [8]:
sales.head()

   sale_id  c_id  p_id  product  qty store
0        1     2     3  Monitor    2   ABC
1        2     2     4      CPU    1   DEF
2        3     1     3  Monitor    3   ABC
3        4     4     2      RAM    2   DEF
4        5     2     3  Monitor    3   ABC

In [9]:
products.head()

   p_id    product  price
0     1  Hard Disk     80
1     2        RAM     90
2     3    Monitor     75
3     4        CPU     55
4     5   Keyboard     20

In [18]:
sales['product'].unique()

array(['Monitor', 'CPU', 'RAM'], dtype=object)

In [45]:
nao_vendidos = sales.merge(products, how='right', on=['p_id','product'])
nao_vendidos[pd.isnull(nao_vendidos['sale_id'])][['product']]

         product
0      Hard Disk
10      Keyboard
11         Mouse
12   Motherboard
13  Power supply

b) Quantos clientes não realizaram uma compra?

In [52]:
nao_compraram = sales.merge(customer, how='right', on=['c_id'])
nao_compraram[nao_compraram['sale_id'].isna()][['Customer']]

   Customer
9      King
10     Ronn
11      Jem
12      Tom

c) Liste a quantidade vendida e o faturamento de cada produto

In [55]:
vendas = sales.merge(products, how='inner', on=['p_id','product'])
vendas['faturamento'] = vendas['qty'] * vendas['price']
vendas

   sale_id  c_id  p_id  product  qty store  price  faturamento
0        1     2     3  Monitor    2   ABC     75          150
1        3     1     3  Monitor    3   ABC     75          225
2        5     2     3  Monitor    3   ABC     75          225
3        6     3     3  Monitor    2   DEF     75          150
4        9     2     3  Monitor    2   ABC     75          150
5        2     2     4      CPU    1   DEF     55           55
6        4     4     2      RAM    2   DEF     90          180
7        7     2     2      RAM    3   ABC     90          270
8        8     3     2      RAM    2   DEF     90          180

In [56]:
vendas.groupby('product')[['qty','faturamento']].sum()

         qty  faturamento
product
CPU        1           55
Monitor   12          900
RAM        7          630

d) Liste a quantidade vendida de cada produto por loja

In [58]:
vendas.groupby(['store','product'])[['qty']].sum()

               qty
store product
ABC   Monitor   10
      RAM        3
DEF   CPU        1
      Monitor    2
      RAM        4

e) Qual loja teve maior faturamento?

In [62]:
vendas.groupby('store')[['faturamento']].sum().sort_values('faturamento').tail(1)

       faturamento
store
ABC           1020

f) Qual produto foi o mais vendido?

In [65]:
vendas.groupby('product')[['qty']].sum().sort_values('qty').tail(1)

         qty
product
Monitor   12